// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

Console.WriteLine("Введите число: ");
Console.Write("A: ");
int afirstDigit = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите число: ");
Console.Write("B: ");
int bsecondDigit = Convert.ToInt32(Console.ReadLine());

int step = Step(afirstDigit, bsecondDigit);

int Step (int a, int b)
{
double Math.Pow(a, b);
}

// Console.WriteLine(Math.Pow);












